import streamlit as st

st.title("ยินดีต้อนรับสู่เว็ปปัญญาอ่อนกระผมเอง")

# 1. กล่องรับชื่อ (ให้คนเล่นกรอก)
# 'username' คือตัวแปรที่จะเก็บชื่อที่ออมพิมพ์เข้าไป
username = st.text_input("กรอกชื่อก่อน!!!!!!!")

# 2. ปุ่มกด (จะทำงานก็ต่อเมื่อออมกรอกชื่อแล้ว)
if st.button("ยืนยัน"):
    if username:  # ตรวจสอบว่าถ้าออมกรอกชื่อมาแล้ว ถึงจะให้ทำข้างล่างนี้
        st.write(f"สวัสดีค้าบ {username} พร้อมแล้วก็ไป")
        st.balloons()  
    else:
        # ถ้ายังไม่กรอกชื่อแล้วกดปุ่ม
        st.error("เฮ้ย! กรอกชื่อก่อนเฟ้ย")